<template>
  <div class="excelDemo">
    <div class="top">中国移动固定支撑类业务结算报表</div>
    <hot-table
      class="main"
      :settings="hotSettings"
      :data="data"
      licenseKey="non-commercial-and-evaluation"
    />
  </div>
</template>

<script>
import { HotTable } from '@handsontable/vue'

export default {
  data: function () {
    return {
      hotSettings: {
        colHeaders: true,
        rowHeaders: true,
        fixedRowsTop: 2, // 固定上边行数
        // 启用公式库
        formulas: true,
        // 右键菜单问题
        contextMenu: ['row_above', 'row_below', 'remove_row', 'mergeCells'],
        mergeCells: true,
        mergeCells: [
          { row: 0, col: 0, rowspan: 2, colspan: 1 },
          { row: 0, col: 1, rowspan: 2, colspan: 1 },
          { row: 0, col: 2, rowspan: 2, colspan: 1 },
          { row: 0, col: 3, rowspan: 1, colspan: 3 },
          { row: 0, col: 6, rowspan: 1, colspan: 3 }
        ],
        tableClassName: ['table01', 'htCenter'],
        stretchH: 'all',
        cell: [
          { row: 0, col: 0, className: 'htCenter htMiddle' }, // 设置下标为0,0的单元格样式 水平居中、垂直居中
          { row: 0, col: 1, className: 'htCenter htMiddle' }, // 设置下标为0,0的单元格样式 水平居中、垂直居中
          { row: 0, col: 2, className: 'htCenter htMiddle' }
        ]

        // preventOverflow: 'vertical', //防止水平溢出表
      },

      data: [
        ['序号', '省公司', '往来投', '应结出', '', '', '应结入', '', '', '结算额'],
        ['', '', '', '不含税金额(A1)', '税额(A2)', '含税金额(A3)', '不含税金额(B1)', '税额(B2)', '含税金额(B3)', '含税金额(C-B3-A3)'],
        ['1', '广东', 2110, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00],
        ['2', '上海', 2810, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00],
        ['3', '天津', 2910, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00],
        ['1', '广东', 2110, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00],
        ['2', '上海', 2810, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00],
        ['3', '天津', 2910, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00],
        ['1', '广东', 2110, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00],
        ['2', '上海', 2810, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00],
        ['3', '天津', 2910, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00],
        ['1', '广东', 2110, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00],
        ['2', '上海', 2810, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00],
        ['3', '天津', 2910, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00],
        ['1', '广东', 2110, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00],
        ['3', '天津', 2910, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00],
        ['1', '广东', 2110, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00],
        ['2', '上海', 2810, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00],
        ['3', '天津', 2910, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00],
        ['1', '广东', 2110, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00],
        ['3', '天津', 2910, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00],
        ['1', '广东', 2110, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00],
        ['2', '上海', 2810, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00],
        ['3', '天津', 2910, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00],
        ['1', 'www', 2110, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00],
        ['1', '广东', 2110, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00],
        ['3', '天津', 2910, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00],
        ['1', '广东', 2110, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00],
        ['2', '上海', 2810, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00],
        ['3', '天津', 2910, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00],
        ['1', 'www', 2110, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00]
      ]// 你的对象数组或者二维数组，可以使用计算属性给其赋值等

    }
  },
  components: {
    HotTable
  }
}
</script>
<style lang="less" scoped>
.excelDemo {
  height: 100%;
  .top {
    height: 10%;
    width: 100%;
    text-align: center;
    font-size: 30px;
  }
  .main {
    margin-top: 10px;
    height: 90%;
    overflow: auto;
  }
}
</style>
